import { IMainInfo } from '../../constants/types';
import imgDmitry from '../../assets/aboutus/dmitry.png';
import imgRoman from '../../assets/aboutus/roman.png';
export const mainRomanInfo: IMainInfo = {
  image: imgRoman,
  name: 'Роман Кадевич',
  role: 'Фронтенд разработчик',
  sex: 'Мужской',
  country: 'Беларусь',
  ghlink: 'https://github.com/RomanKadevich',
};
export const mainDmitryInfo: IMainInfo = {
  image: imgDmitry,
  name: 'Дмитрий Булгаков',
  role: 'Фронтенд разработчик',
  sex: 'Мужской',
  country: 'Россия / Турция',
  ghlink: 'https://github.com/ffriday',
};
export const infoRoman = `Роман, 29 лет, решил изменить свою карьеру и следовать своей страсти к разработке веб-приложений. Несмотря на образование в области управления и экономики, Роман почувствовал, что его истинное призвание связано с миром программирования.
С детства он проявлял интерес к компьютерным технологиям, изучая ActionScript и создавая анимации во Flash. Несколько лет назад он также освоил основы Python, что укрепило его креативный потенциал и вдохновило погрузиться в программирование.
Роман имеет богатый опыт в области управления и экономики. Этот опыт дал ему ценные навыки в организации и планировании, которые помогают ему во время разработки. Более девяти месяцев активного обучения фронтенду укрепили его знания и навыки, делая его готовым к созданию веб-приложений любой сложности.`;

export const contributionRoman = `Роман занимал важную роль в рамках проекта. Его обязанности включали разработку пользовательского интерфейса, отличающегося не только привлекательным дизайном, но и высокой функциональностью. Кроме того, он успешно решал задачи по оптимизации кода, что способствовало увеличению производительности приложения и уменьшению технических проблем.
Его активное участие в обсуждениях
и разработке стратегии реализации оказало важное влияние на достижение общих целей проекта.
В итоге, его вклад в проект обеспечил завершение разработки приложения
и обеспеченил высокий уровень его качества.`;
export const difficultiesRoman = `Важно отметить, что в начале проекта возникла значительная трудность из-за отсутствия опыта работы Романа с React. Это требовало интенсивного самообучения и освоения большого объема новых знаний в процессе разработки. Роман проявил  усердие
и усилия, чтобы осоить основы данной технологии, и его решимость в обучении оказала важное воздействие на успешное завершение проекта.
Этот опыт также подчеркнул его способность быстро адаптироваться
и преодолевать трудности в профессиональном росте.`;

export const infoDmitry =
  'Дмитрий, 35 лет, в 2022 году принял решение переехать и развиваться в новой профессии - разработке веб-приложений. Программирование и компьютерами Дмитрий заинтересовался в старшей школе, когда у него появился первый компьютер. С тех пор он получил высшее образование в области обработки информации в геофизике, изучал и применял языки программирования, такие как Visual Basic, C#, Python, Fortran, но это не было его основным видом деятельности. Дмитрий строил, проектировал и руководил проектами по строительству бассейнов и фитнесов.Но пришло время для изменений и Дмитрий твердо решил освоить навыки по разработке на JavaScript. Этот шаг, а так-же опыт в управлении проектами позволит ему использовать свои знания и навыки в создание современных веб-приложений и приблизит его к его новой карьере в ИТ-сфере.';

export const contributionDmitry = '';
export const difficultiesDmitry = '';
